; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=213, out_folder=./training, instance_id=31, seed=2055, goal_proportion=0.03

(define (problem blocksworld-31)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 - object)
 (:init 
    (arm-empty)
    (clear b36)
    (on b36 b65)
    (on-table b65)
    (clear b149)
    (on b149 b127)
    (on b127 b120)
    (on b120 b96)
    (on b96 b70)
    (on-table b70)
    (clear b22)
    (on-table b22)
    (clear b86)
    (on b86 b72)
    (on b72 b19)
    (on b19 b128)
    (on-table b128)
    (clear b64)
    (on b64 b198)
    (on b198 b159)
    (on b159 b111)
    (on b111 b42)
    (on b42 b5)
    (on b5 b157)
    (on-table b157)
    (clear b153)
    (on b153 b56)
    (on-table b56)
    (clear b148)
    (on b148 b48)
    (on-table b48)
    (clear b106)
    (on-table b106)
    (clear b7)
    (on b7 b161)
    (on b161 b39)
    (on-table b39)
    (clear b59)
    (on b59 b82)
    (on b82 b124)
    (on b124 b137)
    (on b137 b18)
    (on b18 b201)
    (on-table b201)
    (clear b24)
    (on b24 b67)
    (on b67 b68)
    (on b68 b163)
    (on-table b163)
    (clear b158)
    (on-table b158)
    (clear b166)
    (on-table b166)
    (clear b38)
    (on b38 b69)
    (on-table b69)
    (clear b75)
    (on b75 b126)
    (on b126 b178)
    (on b178 b1)
    (on b1 b199)
    (on-table b199)
    (clear b179)
    (on b179 b154)
    (on b154 b31)
    (on b31 b21)
    (on b21 b210)
    (on b210 b62)
    (on b62 b102)
    (on b102 b144)
    (on b144 b73)
    (on b73 b103)
    (on b103 b41)
    (on-table b41)
    (clear b119)
    (on-table b119)
    (clear b12)
    (on b12 b191)
    (on b191 b66)
    (on b66 b107)
    (on b107 b94)
    (on b94 b212)
    (on b212 b184)
    (on b184 b13)
    (on b13 b168)
    (on-table b168)
    (clear b76)
    (on b76 b172)
    (on b172 b181)
    (on-table b181)
    (clear b29)
    (on b29 b63)
    (on b63 b51)
    (on-table b51)
    (clear b4)
    (on-table b4)
    (clear b213)
    (on b213 b155)
    (on-table b155)
    (clear b33)
    (on b33 b183)
    (on b183 b78)
    (on b78 b83)
    (on b83 b143)
    (on-table b143)
    (clear b129)
    (on b129 b9)
    (on b9 b207)
    (on b207 b45)
    (on b45 b147)
    (on-table b147)
    (clear b176)
    (on b176 b110)
    (on-table b110)
    (clear b99)
    (on b99 b174)
    (on b174 b134)
    (on b134 b139)
    (on-table b139)
    (clear b186)
    (on b186 b98)
    (on b98 b30)
    (on-table b30)
    (clear b32)
    (on b32 b177)
    (on-table b177)
    (clear b54)
    (on b54 b16)
    (on-table b16)
    (clear b93)
    (on b93 b92)
    (on-table b92)
    (clear b160)
    (on b160 b194)
    (on b194 b90)
    (on b90 b105)
    (on b105 b60)
    (on b60 b40)
    (on-table b40)
    (clear b115)
    (on b115 b84)
    (on b84 b104)
    (on b104 b57)
    (on-table b57)
    (clear b26)
    (on b26 b109)
    (on b109 b79)
    (on-table b79)
    (clear b25)
    (on b25 b97)
    (on b97 b117)
    (on-table b117)
    (clear b14)
    (on b14 b209)
    (on b209 b114)
    (on-table b114)
    (clear b91)
    (on b91 b89)
    (on-table b89)
    (clear b187)
    (on b187 b55)
    (on-table b55)
    (clear b200)
    (on b200 b95)
    (on-table b95)
    (clear b116)
    (on b116 b136)
    (on b136 b165)
    (on b165 b11)
    (on b11 b173)
    (on b173 b80)
    (on-table b80)
    (clear b6)
    (on b6 b2)
    (on b2 b23)
    (on b23 b112)
    (on-table b112)
    (clear b202)
    (on b202 b203)
    (on b203 b142)
    (on b142 b37)
    (on b37 b3)
    (on b3 b167)
    (on b167 b135)
    (on b135 b175)
    (on b175 b100)
    (on b100 b170)
    (on b170 b74)
    (on-table b74)
    (clear b133)
    (on b133 b130)
    (on-table b130)
    (clear b197)
    (on b197 b131)
    (on b131 b125)
    (on b125 b156)
    (on b156 b192)
    (on b192 b108)
    (on-table b108)
    (clear b49)
    (on b49 b50)
    (on b50 b61)
    (on b61 b204)
    (on b204 b164)
    (on-table b164)
    (clear b141)
    (on b141 b193)
    (on b193 b20)
    (on b20 b88)
    (on-table b88)
    (clear b52)
    (on-table b52)
    (clear b58)
    (on b58 b188)
    (on b188 b81)
    (on-table b81)
    (clear b140)
    (on b140 b122)
    (on b122 b101)
    (on-table b101)
    (clear b152)
    (on b152 b77)
    (on b77 b206)
    (on b206 b8)
    (on b8 b15)
    (on b15 b196)
    (on b196 b87)
    (on b87 b185)
    (on-table b185)
    (clear b132)
    (on b132 b211)
    (on-table b211)
    (clear b46)
    (on-table b46)
    (clear b121)
    (on b121 b162)
    (on b162 b145)
    (on b145 b195)
    (on-table b195)
    (clear b151)
    (on b151 b35)
    (on-table b35)
    (clear b27)
    (on b27 b180)
    (on-table b180)
    (clear b171)
    (on b171 b138)
    (on b138 b118)
    (on b118 b10)
    (on b10 b208)
    (on b208 b169)
    (on-table b169)
    (clear b190)
    (on b190 b53)
    (on b53 b123)
    (on b123 b146)
    (on b146 b189)
    (on b189 b182)
    (on b182 b85)
    (on b85 b34)
    (on b34 b205)
    (on b205 b43)
    (on b43 b150)
    (on b150 b17)
    (on b17 b28)
    (on b28 b113)
    (on b113 b47)
    (on b47 b71)
    (on-table b71)
    (clear b44)
    (on-table b44))
 (:goal  (and 
    (clear b2)
    (on-table b2)
    (clear b6)
    (on b6 b1)
    (on b1 b3)
    (on-table b3)
    (clear b4)
    (on b4 b5)
    (on-table b5))))

; plan
1. (unstack b202 b203)
   deleted: (on b202 b203) (clear b202) (arm-empty)
   added: (holding b202) (clear b203)
   goals met: 2 of 9
2. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 2 of 9
3. (unstack b203 b142)
   deleted: (on b203 b142) (clear b203) (arm-empty)
   added: (holding b203) (clear b142)
   goals met: 2 of 9
4. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 2 of 9
5. (unstack b142 b37)
   deleted: (on b142 b37) (clear b142) (arm-empty)
   added: (holding b142) (clear b37)
   goals met: 2 of 9
6. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 2 of 9
7. (unstack b37 b3)
   deleted: (on b37 b3) (clear b37) (arm-empty)
   added: (holding b37) (clear b3)
   goals met: 2 of 9
8. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 2 of 9
9. (unstack b3 b167)
   deleted: (on b3 b167) (clear b3) (arm-empty)
   added: (holding b3) (clear b167)
   goals met: 2 of 9
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 9
11. (unstack b64 b198)
   deleted: (on b64 b198) (clear b64) (arm-empty)
   added: (holding b64) (clear b198)
   goals met: 3 of 9
12. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 3 of 9
13. (unstack b198 b159)
   deleted: (on b198 b159) (clear b198) (arm-empty)
   added: (holding b198) (clear b159)
   goals met: 3 of 9
14. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 3 of 9
15. (unstack b159 b111)
   deleted: (on b159 b111) (clear b159) (arm-empty)
   added: (holding b159) (clear b111)
   goals met: 3 of 9
16. (putdown b159)
   deleted: (holding b159)
   added: (clear b159) (arm-empty) (on-table b159)
   goals met: 3 of 9
17. (unstack b111 b42)
   deleted: (on b111 b42) (clear b111) (arm-empty)
   added: (holding b111) (clear b42)
   goals met: 3 of 9
18. (putdown b111)
   deleted: (holding b111)
   added: (clear b111) (arm-empty) (on-table b111)
   goals met: 3 of 9
19. (unstack b42 b5)
   deleted: (on b42 b5) (clear b42) (arm-empty)
   added: (holding b42) (clear b5)
   goals met: 3 of 9
20. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 3 of 9
21. (unstack b5 b157)
   deleted: (on b5 b157) (clear b5) (arm-empty)
   added: (holding b5) (clear b157)
   goals met: 3 of 9
22. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 9
23. (unstack b75 b126)
   deleted: (on b75 b126) (clear b75) (arm-empty)
   added: (holding b75) (clear b126)
   goals met: 4 of 9
24. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 4 of 9
25. (unstack b126 b178)
   deleted: (on b126 b178) (clear b126) (arm-empty)
   added: (holding b126) (clear b178)
   goals met: 4 of 9
26. (putdown b126)
   deleted: (holding b126)
   added: (clear b126) (arm-empty) (on-table b126)
   goals met: 4 of 9
27. (unstack b178 b1)
   deleted: (on b178 b1) (clear b178) (arm-empty)
   added: (holding b178) (clear b1)
   goals met: 4 of 9
28. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 4 of 9
29. (unstack b1 b199)
   deleted: (on b1 b199) (clear b1) (arm-empty)
   added: (holding b1) (clear b199)
   goals met: 4 of 9
30. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 5 of 9
31. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 5 of 9
32. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 7 of 9
33. (unstack b2 b23)
   deleted: (on b2 b23) (clear b2) (arm-empty)
   added: (holding b2) (clear b23)
   goals met: 6 of 9
34. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 8 of 9
35. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 9
36. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 9 of 9
